Repository: ArsenalPay/WooCommerce-ArsenalPay-CMS
Catalog: wc-arsenalpay/languages/wc-arsenalpay-*.po
Languages: ru_ru

source: Allows payments with ArsenalPay gateway
ru_ru: Позволяет принимать платежи с помощью платежной системы ArsenalPay

source: Enable ArsenalPay
ru_ru: Включить ArsenalPay

source: Pay with ArsenalPay.
ru_ru: Оплатите с ArsenalPay.

source: Unique token
ru_ru: Уникальный токен

source: Assigned to merchant for the access to ArsenalPay payment frame. Required.
ru_ru: Присваивается предприятию для доступа к платежному фрейму. Обязательный.

source: Other number or code required for making payments
ru_ru: Дополнительный номер или код, необходимый для оплаты

source: Not accessible for editing to the user and not displayed if it is set. Optional.
ru_ru: Недоступен для редактирования плательщику и не отображается в случае, если задан. Необязательный.

source: Frame URL
ru_ru: URL-адрес фрейма

source: URL-address of ArsenalPay payment frame. Required.
ru_ru: URL-адрес платежного фрейма ArsenalPay. Обязательный.

source: src parameter
ru_ru: Параметр src

source: Payment type. Possible options: mk - payment from mobile phone (mobile commerce), card - payment by bank card (internet-acquiring). Optional.
ru_ru: Тип оплаты. Возможные варианты: mk - оплата с мобильного телефона (мобильная коммерция). card - оплата с пластиковой карты (интернет эквайринг).

source: css option
ru_ru: Параметр css

source: URL of CSS file if exists. Optional.
ru_ru: Aдрес (URL) CSS файла. Необязательный.

source: Sign key
ru_ru: Ключ

source: With this key you check a validity of sign that comes with callback payment data. Required.
ru_ru: Для проверки подписи данных, которые приходят с обратным запросом . Обязательный.

source: Allowed IP-address
ru_ru: Разрешенный IP-адрес

source: It can be allowed to receive ArsenalPay payment confirmation callback requests only from the ip address pointed out here. Optional.
ru_ru: Только с которого будут разрешены обратные запросы о подтверждении платежей от ArsenalPay. Необязательный.

source: Check URL.
ru_ru: URL для проверки.

source: URL to check the existance of transaction. Optional
ru_ru: Для проверки существования номера заказа перед подтверждением платежа. Необязательный.

source: Frame display mode
ru_ru: Режим отображения фрейма

source: 1 - to display inside a frame, otherwise on fullscreen payment frame page. Optional.
ru_ru: 1 - отображать фрейм внутри страницы сайта, иначе - на странице фрейма. Необязательный.

source: Frame parameters
ru_ru: Дополнительные параметры фрейма

source: Parameters of iFrame. Optional.
ru_ru: Параметры iframe. Необязательный.

source: Log ArsenalPay events, such as callback requests
ru_ru: Записывать логи событий, такие как обратные запросы

source: Success redirect
ru_ru: Перенаправление при успешной оплате

source: Failure redirect
ru_ru: Перенаправление при неудавшейся оплате

source: Callback URL
ru_ru: URL для обратного запроса

source: ArsenalPay does not support your store currency.
ru_ru: ArsenalPay не поддерживает валюту Вашего магазина.

source: Validation error: ArsenalPay amounts do not match (amount %s).
ru_ru: Ошибка подтверждения: сумма с запросом ArsenalPay не совпадает (сумма %s).

source: Order number has been checked.
ru_ru: Номер заказа проверен.

source: Waiting for payment confirmation after checking.
ru_ru: Ожидание подтверждения платежа после проверки.

source: Payment received with less amount equal to %s.
ru_ru: Платеж получен с меньшей суммой равной %s.

source: Payment completed.
ru_ru: Платеж завершен.

source: Payment failed via callback.
ru_ru: Платеж не подтвержился при получении обратного запроса.

source: Payer redirected to the success page.
ru_ru: Покупатель перенаправлен на страницу с результатом успешной оплаты.

source: Payer cancelled the payment or error occured. Redirected to fail page.
ru_ru: Покупатель отменил платеж либо возникла ошибка. Перенаправлен на страницу неудавшейся оплаты.
